In [94]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [95]:
csv_file = "economic_freedom.csv"
freedom_data_df = pd.read_csv(csv_file)
freedom_data_df.head()

,freedom_id,country_name,index_year,overall_score,property rights,government integrity,judicial effectiveness,tax burden,government spending,fiscal health,business_freedom,labor freedom,monetary_freedom,trade_freedom,investment_freedom,financial_freedom
0,1,Afghanistan,2016,NaN,NaN,12.0,NaN,91.6,81.2,NaN,56.6,63.2,NaN,NaN,55.0,NaN
1,2,Albania,2016,65.9,35.0,33.0,NaN,87.8,75.0,NaN,67.6,51.5,81.7,87.6,70.0,70.0
2,3,Algeria,2016,50.1,25.0,36.0,NaN,81.0,59.4,NaN,62.1,48.2,68.1,60.8,30.0,30.0
3,4,Angola,2016,48.9,15.0,19.0,NaN,87.8,50.1,NaN,50.3,44.8,72.2,70.2,40.0,40.0
4,5,Argentina,2016,43.8,15.0,34.0,NaN,66.1,51.3,NaN,56.0,43.9,44.0,67.4,30.0,30.0

In [96]:
new_freedom_data = freedom_data_df[['freedom_id','country_name','index_year', 'overall_score']].copy()
new_freedom_data.head()

   freedom_id country_name  index_year  overall_score
0           1  Afghanistan        2016            NaN
1           2      Albania        2016           65.9
2           3      Algeria        2016           50.1
3           4       Angola        2016           48.9
4           5    Argentina        2016           43.8

In [97]:
v2_freedom_data= new_freedom_data[pd.notnull(new_freedom_data['overall_score'])]
v2_freedom_data.head()

   freedom_id country_name  index_year  overall_score
1           2      Albania        2016           65.9
2           3      Algeria        2016           50.1
3           4       Angola        2016           48.9
4           5    Argentina        2016           43.8
5           6      Armenia        2016           67.0

In [98]:
csv2_file = "world_trade_banking.csv"
trading_data_df = pd.read_csv(csv2_file)
trading_data_df.head()

,trade_id,location,INDICATOR,SUBJECT,MEASURE,FREQUENCY,time,value,Unnamed: 8
0,1.0,AUS,BOP,TOT,MLN_USD,A,1960.0,-723.71660,NaN
1,2.0,AUS,BOP,TOT,MLN_USD,A,1961.0,-31.26144,NaN
2,3.0,AUS,BOP,TOT,MLN_USD,A,1962.0,-182.69510,NaN
3,4.0,AUS,BOP,TOT,MLN_USD,A,1963.0,-31.43871,NaN
4,5.0,AUS,BOP,TOT,MLN_USD,A,1964.0,-301.52540,NaN

In [99]:
trading_data = trading_data_df[['trade_id','location','time','value']].copy()
trading_data.head()

   trade_id location    time      value
0       1.0      AUS  1960.0 -723.71660
1       2.0      AUS  1961.0  -31.26144
2       3.0      AUS  1962.0 -182.69510
3       4.0      AUS  1963.0  -31.43871
4       5.0      AUS  1964.0 -301.52540

In [110]:
csv3_file="countrycode.csv"
countrycode_df = pd.read_csv(csv3_file)
countrycode_df.head()

  location   country_name
0      ABW          Aruba
1      AFG    Afghanistan
2      AGO         Angola
3      AIA       Anguilla
4      ALA  Åland Islands

In [111]:
new_trading_data = pd.merge(trading_data,countrycode_df, on="location")
new_trading_data.head()

   trade_id location    time      value country_name
0       1.0      AUS  1960.0 -723.71660    Australia
1       2.0      AUS  1961.0  -31.26144    Australia
2       3.0      AUS  1962.0 -182.69510    Australia
3       4.0      AUS  1963.0  -31.43871    Australia
4       5.0      AUS  1964.0 -301.52540    Australia

In [112]:
rds_connection_string = "postgres:postgres@localhost:5432/ETL_project"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [113]:
engine.table_names()

['new_trading_data', 'v2_freedom_data']

In [104]:
v2_freedom_data.to_sql(name='v2_freedom_data', con=engine, if_exists='append', index=False)

IntegrityError: (psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "v2_freedom_data_pkey"
DETAIL:  Key (freedom_id)=(2) already exists.

[SQL: INSERT INTO v2_freedom_data (freedom_id, country_name, index_year, overall_score) VALUES (%(freedom_id)s, %(country_name)s, %(index_year)s, %(overall_score)s)]
[parameters: ({'freedom_id': 2, 'country_name': 'Albania', 'index_year': 2016, 'overall_score': 65.9}, {'freedom_id': 3, 'country_name': 'Algeria', 'index_year': 2016, 'overall_score': 50.1}, {'freedom_id': 4, 'country_name': 'Angola', 'index_year': 2016, 'overall_score': 48.9}, {'freedom_id': 5, 'country_name': 'Argentina', 'index_year': 2016, 'overall_score': 43.8}, {'freedom_id': 6, 'country_name': 'Armenia', 'index_year': 2016, 'overall_score': 67.0}, {'freedom_id': 7, 'country_name': 'Australia', 'index_year': 2016, 'overall_score': 80.3}, {'freedom_id': 8, 'country_name': 'Austria', 'index_year': 2016, 'overall_score': 71.7}, {'freedom_id': 9, 'country_name': 'Azerbaijan', 'index_year': 2016, 'overall_score': 60.2}  ... displaying 10 of 3543 total bound parameter sets ...  {'freedom_id': 4039, 'country_name': 'Zambia', 'index_year': 1995, 'overall_score': 55.1}, {'freedom_id': 4040, 'country_name': 'Zimbabwe', 'index_year': 1995, 'overall_score': 48.5})]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [114]:
new_trading_data.to_sql(name='new_trading_data', con=engine, if_exists='append', index=False)

In [115]:
pd.read_sql_query('select * from v2_freedom_data', con=engine).head()

   freedom_id country_name  index_year  overall_score
0           2      Albania        2016           65.9
1           3      Algeria        2016           50.1
2           4       Angola        2016           48.9
3           5    Argentina        2016           43.8
4           6      Armenia        2016           67.0

In [116]:
pd.read_sql_query('select * from new_trading_data', con=engine).head()

   trade_id location  time      value country_name
0         1      AUS  1960 -723.71660    Australia
1         2      AUS  1961  -31.26144    Australia
2         3      AUS  1962 -182.69510    Australia
3         4      AUS  1963  -31.43871    Australia
4         5      AUS  1964 -301.52540    Australia

In [117]:
engine.table_names()

['new_trading_data', 'v2_freedom_data', 'joined_data']

In [119]:
pd.read_sql_query('select * from joined_data', con=engine).head()

  country_name  index_year  overall_score     value
0    Australia        1995           74.1 -18914.44
1    Australia        1996           74.0 -14718.47
2    Australia        1997           75.5 -12403.25
3    Australia        1998           75.6 -18663.68
4    Australia        1999           76.4 -22541.70